app/views/customers/print.html.erb

  <tbody>
    <% @customer.bills.each do |bill| %>
---
SELECT "bills".* FROM "bills" WHERE "bills"."customer_id" = $1  [["customer_id", 272]]