app/views/dealers/print3.html.erb

SELECT "dealerbills".* FROM "dealerbills" WHERE "dealerbills"."dealer_id" = $1  [["dealer_id", 36]]
---
  <tbody>
    <% @dealer.dealerbills.each do |bill| %>