app/controllers/bills_controller.rb

  def show
    @customer = Customer.find(@bill.customer_id)
    @stocks = Stock.all
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks"

  def print2
    id = request.path.split('.').last
    @bill = Bill.find(id)
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT $2  [["id", 553], ["LIMIT", 1]]

  def create
    @customer = Customer.find(params[:customer_id])
    @bill = @customer.bills.create(bill_params)
    respond_to do |format|
      if @customer.save
        format.html { redirect_to @bill, notice: "Bill was successfully created." }
        format.json { render :show, status: :created, location: @customer }
      else
        format.html{redirect_to customer_path(@customer),notice: "Duplicate Bill was found"}
      end
    end

    sum = 0
    rec = 0
    bal = 0

    @customer.bills.each do |bill|
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
INSERT INTO "bills" ("billno", "date", "credit", "debit", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["billno", "b32"], ["date", "2024-01-16"], ["credit", 0.0], ["debit", 0.0], ["customer_id", 272], ["created_at", "2024-01-16 07:49:17.463408"], ["updated_at", "2024-01-16 07:49:17.463408"]]
SELECT "bills".* FROM "bills" WHERE "bills"."customer_id" = $1  [["customer_id", 272]]

  def credit
    credit = params[:credit]
    debit = params[:debit]
    remark = params[:remark]

    id = params[:id]
    @bill = Bill.find(id)
    @bill.update(credit:credit,debit:debit,remark:remark)

    sum = 0
    rec = 0
    bal = 0
    cust = @bill.customer_id
    @customer = Customer.find(cust)

    @customer.bills.each do |bill|
      sum = (sum + bill.credit)
      rec = ( rec + bill.debit)
      bal = sum - rec
    end

    @customer.update(total:sum,recieve:rec,balance:bal)
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT $2  [["id", 553], ["LIMIT", 1]]
UPDATE "bills" SET "credit" = $1, "debit" = $2, "remark" = $3, "updated_at" = $4 WHERE "bills"."id" = $5  [["credit", 3000.0], ["debit", 1000.0], ["remark", "1 week"], ["updated_at", "2024-01-16 07:49:33.960919"], ["id", 553]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
SELECT "bills".* FROM "bills" WHERE "bills"."customer_id" = $1  [["customer_id", 272]]
UPDATE "customers" SET "total" = $1, "recieve" = $2, "balance" = $3, "updated_at" = $4 WHERE "customers"."id" = $5  [["total", 3000.0], ["recieve", 1000.0], ["balance", 2000.0], ["updated_at", "2024-01-16 07:49:33.991347"], ["id", 272]]

    def set_bill
      @bill = Bill.find(params[:id])
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT $2  [["id", 553], ["LIMIT", 1]]