app/controllers/customers_controller.rb

  def index
    @customers = Customer.order('name ASC').all
    @totalcustomer = Customer.count
---
SELECT "customers".* FROM "customers" ORDER BY name ASC
SELECT COUNT(*) FROM "customers"

  def show
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]

  def print
    id = request.path.split('.').last
    @customer = Customer.find(id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "father", "address", "mobile", "total", "recieve", "balance", "created_at", "updated_at", "block") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @customer = Customer.find(params[:id])

    if @customer.update(customer_params)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
UPDATE "customers" SET "name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["name", "z"], ["updated_at", "2024-01-16 07:51:45.057801"], ["id", 272]]

  def search
    @parameter = params[:search].downcase
    @select  = params[:select]
    begin
    if params[:search].blank?
       redirect_to(root_path, notice: 'Search field is empty' ) and return
    else
      if @select == 'name'
      @results = Customer.all.where("lower(name) LIKE :search", search: @parameter)
---
SELECT "customers".* FROM "customers" WHERE (lower(address) LIKE 'c')

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 272]]