app/controllers/dealers_controller.rb

SELECT "dealers".* FROM "dealers" ORDER BY name ASC
SELECT COUNT(*) FROM "dealers"
---
  def index
    @dealers = Dealer.all
    @dealers = Dealer.order('name ASC').all
    @totaldealer = Dealer.count

SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def show
    @dealer = Dealer.find(params[:id])

SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def print3
    id = request.path.split('.').last
    @dealer = Dealer.find(id)

INSERT INTO "dealers" ("name", "address", "mobile", "total", "recieve", "balance", "created_at", "updated_at", "block") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @dealer = Dealer.new(dealer_params)

    respond_to do |format|
      if @dealer.save

UPDATE "dealers" SET "address" = $1, "block" = $2, "mobile" = $3, "updated_at" = $4 WHERE "dealers"."id" = $5  [["address", "khitaula"], ["block", "sihora"], ["mobile", "1234566789"], ["updated_at", "2024-01-16 07:53:20.561711"], ["id", 36]]
---
  def update
    respond_to do |format|
      if @dealer.update(dealer_params)

SELECT "dealers".* FROM "dealers" WHERE (lower(address) LIKE 'khitaula')
---
  def dealersearch
    @parameter = params[:search].downcase
    @select  = params[:select]
    begin
    if params[:search].blank?
       redirect_to(root_path, notice: 'Search field is empty' ) and return
    else
      if @select == 'name'
      @results = Dealer.all.where("lower(name) LIKE :search", search: @parameter)

SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
    def set_dealer
      @dealer = Dealer.find(params[:id])