app/controllers/dealerbills_controller.rb

  def show
    @dealer = Dealer.find(@dealerbill.dealer_id)
    @stocks = Stock.all
---
SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks"

  def create
    @dealer = Dealer.find(params[:dealer_id])
    @dealerbill = @dealer.dealerbills.create(dealerbill_params)

    respond_to do |format|
      if @dealerbill.save
        format.html { redirect_to @dealerbill, notice: "Dealerbill was successfully created." }
        format.json { render :show, status: :created, location: @dealerbill }
      else
        format.html { render :new, status: :unprocessable_entity }
        format.json { render json: @dealerbill.errors, status: :unprocessable_entity }
      end
    end
    sum = 0
    rec = 0
    bal = 0

    @dealer.dealerbills.each do |bill|
---
SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
INSERT INTO "dealerbills" ("billno", "date", "credit", "debit", "dealer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["billno", "b33"], ["date", "2024-01-16"], ["credit", 0.0], ["debit", 0.0], ["dealer_id", 36], ["created_at", "2024-01-16 07:53:29.571527"], ["updated_at", "2024-01-16 07:53:29.571527"]]
SELECT "dealerbills".* FROM "dealerbills" WHERE "dealerbills"."dealer_id" = $1  [["dealer_id", 36]]

  def credit2
    credit = params[:credit]
    debit = params[:debit]
    remark = params[:remark]

    id = params[:id]
    @dealerbill = Dealerbill.find(id)
    @dealerbill.update(credit:credit,debit:debit,remark:remark)

    sum = 0
    rec = 0
    bal = 0
    cust = @dealerbill.dealer_id
    @dealer = Dealer.find(cust)

    @dealer.dealerbills.each do |bill|
      sum = (sum + bill.credit)
      rec = ( rec + bill.debit)
      bal = sum - rec
    end

    @dealer.update(total:sum,recieve:rec,balance:bal)
---
SELECT "dealerbills".* FROM "dealerbills" WHERE "dealerbills"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]
UPDATE "dealers" SET "total" = $1, "recieve" = $2, "balance" = $3, "updated_at" = $4 WHERE "dealers"."id" = $5  [["total", 15000.0], ["recieve", 12000.0], ["balance", 3000.0], ["updated_at", "2024-01-16 07:53:42.304358"], ["id", 36]]
UPDATE "dealerbills" SET "credit" = $1, "debit" = $2, "remark" = $3, "updated_at" = $4 WHERE "dealerbills"."id" = $5  [["credit", 15000.0], ["debit", 12000.0], ["remark", ""], ["updated_at", "2024-01-16 07:53:42.259354"], ["id", 106]]
SELECT "dealers".* FROM "dealers" WHERE "dealers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
SELECT "dealerbills".* FROM "dealerbills" WHERE "dealerbills"."dealer_id" = $1  [["dealer_id", 36]]

    def set_dealerbill
      @dealerbill = Dealerbill.find(params[:id])
---
SELECT "dealerbills".* FROM "dealerbills" WHERE "dealerbills"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]