app/controllers/works_controller.rb

SELECT "works".* FROM "works"
---
  def index
    @works = Work.all

INSERT INTO "works" ("name", "HP", "company", "model", "pitch1", "connection", "coil", "pitch2", "remark", "amount", "created_at", "updated_at", "amount2", "mobile", "date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save

SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 436], ["LIMIT", 1]]
---
    def set_work
      @work = Work.find(params[:id])